menu = {
    '1티어': ['돈까스', '찜닭', '수제비','부대찌개','순대국밥','김치말이국수','감자탕','콩나물국밥','동태탕','피자','김치볶음밥','육회'
            '칼국수','순두부찌개','김치찜','갈비','삼겹살','닭갈비','제육볶음','고등어구이','곤드레밥','간장게장','설렁탕','등뼈탕'],
    '2티어': ['파스타','초밥','라멘','양고기','떡볶이','족발','마라탕','냉면','라면','함바그','전복죽','카레','햄버거','빠네','치킨','장어','닭강정'
            '보쌈','닭발','쌀국수','오코노미야끼','사케동','회','짜장면','우동','콩국수','카이센동','계란찜','볶음면','김밥','텐동','간장계란밥'],
    '3티어': ['샌드위치','부리또','전','타코야끼','만두','감자전','그릭요거트','팬케이크','샐러드','케밥','누룽지','롤케이크','콜팝',
            '스프','주먹밥','떡','감자','순대볶음','씨리얼','삼각김밥','케이크','유부초밥','딸기라떼','에그타르트','스크램블','카이막'],
}

import random

def getTier():
    val = random.randint(0, 100)
    if 0 <= val < 50:
        return '1티어'
    elif val < 80:
        return '2티어'
    else:
        return '3티어'

selected_menu = random.randint(0, len(menu[getTier()]))
print(menu[getTier()][selected_menu])